HarrisonHuang2/STM32_NUEDC_LIB/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define OLED_SCL_Pin GPIO_PIN_13
#define OLED_SCL_GPIO_Port GPIOC
#define KEY_R1_Pin GPIO_PIN_6
#define KEY_R1_GPIO_Port GPIOC
#define KEY_R2_Pin GPIO_PIN_7
#define KEY_R2_GPIO_Port GPIOC
#define KEY_R3_Pin GPIO_PIN_8
#define KEY_R3_GPIO_Port GPIOC
#define RELAY1_Pin GPIO_PIN_9
#define RELAY1_GPIO_Port GPIOC
#define KEY_R4_Pin GPIO_PIN_12
#define KEY_R4_GPIO_Port GPIOA
#define KEY_C4_Pin GPIO_PIN_15
#define KEY_C4_GPIO_Port GPIOA
#define KEY_C1_Pin GPIO_PIN_10
#define KEY_C1_GPIO_Port GPIOC
#define KEY_C2_Pin GPIO_PIN_11
#define KEY_C2_GPIO_Port GPIOC
#define KEY_C3_Pin GPIO_PIN_12
#define KEY_C3_GPIO_Port GPIOC
#define OLED_SDA_Pin GPIO_PIN_3
#define OLED_SDA_GPIO_Port GPIOB
#define OLED_DC_Pin GPIO_PIN_4
#define OLED_DC_GPIO_Port GPIOB
#define OLED_CS_Pin GPIO_PIN_5
#define OLED_CS_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
